MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX530F128L.PIC
      <edc:SFRDef edc:_addr="0x1F886330" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-02495_TRAN_Ports.Module" edc:_refcount="4" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="LATD" edc:desc="" edc:grp="PORTD" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="LATD" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATD0" edc:desc="" edc:mask="0x1" edc:name="LATD0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD1" edc:desc="" edc:mask="0x1" edc:name="LATD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD2" edc:desc="" edc:mask="0x1" edc:name="LATD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD3" edc:desc="" edc:mask="0x1" edc:name="LATD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD4" edc:desc="" edc:mask="0x1" edc:name="LATD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD5" edc:desc="" edc:mask="0x1" edc:name="LATD5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD6" edc:desc="" edc:mask="0x1" edc:name="LATD6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD7" edc:desc="" edc:mask="0x1" edc:name="LATD7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD8" edc:desc="" edc:mask="0x1" edc:name="LATD8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATD9" edc:desc="" edc:mask="0x1" edc:name="LATD9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD10" edc:desc="" edc:mask="0x1" edc:name="LATD10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD11" edc:desc="" edc:mask="0x1" edc:name="LATD11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATD12" edc:desc="" edc:mask="0x1" edc:name="LATD12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATD13" edc:desc="" edc:mask="0x1" edc:name="LATD13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATD14" edc:desc="" edc:mask="0x1" edc:name="LATD14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD15" edc:desc="" edc:mask="0x1" edc:name="LATD15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886340" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-02495_TRAN_Ports.Module" edc:_refcount="4" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="ODCD" edc:desc="" edc:grp="PORTD" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="ODCD" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCD0" edc:desc="" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD1" edc:desc="" edc:mask="0x1" edc:name="ODCD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD2" edc:desc="" edc:mask="0x1" edc:name="ODCD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD3" edc:desc="" edc:mask="0x1" edc:name="ODCD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD4" edc:desc="" edc:mask="0x1" edc:name="ODCD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD5" edc:desc="" edc:mask="0x1" edc:name="ODCD5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD6" edc:desc="" edc:mask="0x1" edc:name="ODCD6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD7" edc:desc="" edc:mask="0x1" edc:name="ODCD7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD8" edc:desc="" edc:mask="0x1" edc:name="ODCD8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCD9" edc:desc="" edc:mask="0x1" edc:name="ODCD9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD10" edc:desc="" edc:mask="0x1" edc:name="ODCD10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD11" edc:desc="" edc:mask="0x1" edc:name="ODCD11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCD12" edc:desc="" edc:mask="0x1" edc:name="ODCD12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCD13" edc:desc="" edc:mask="0x1" edc:name="ODCD13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCD14" edc:desc="" edc:mask="0x1" edc:name="ODCD14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD15" edc:desc="" edc:mask="0x1" edc:name="ODCD15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886350" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-02495_TRAN_Ports.Module" edc:_refcount="4" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNPUD" edc:desc="" edc:grp="PORTD" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="CNPUD" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUD0" edc:desc="" edc:mask="0x1" edc:name="CNPUD0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD1" edc:desc="" edc:mask="0x1" edc:name="CNPUD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD2" edc:desc="" edc:mask="0x1" edc:name="CNPUD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD3" edc:desc="" edc:mask="0x1" edc:name="CNPUD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD4" edc:desc="" edc:mask="0x1" edc:name="CNPUD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD5" edc:desc="" edc:mask="0x1" edc:name="CNPUD5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD6" edc:desc="" edc:mask="0x1" edc:name="CNPUD6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD7" edc:desc="" edc:mask="0x1" edc:name="CNPUD7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD8" edc:desc="" edc:mask="0x1" edc:name="CNPUD8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD9" edc:desc="" edc:mask="0x1" edc:name="CNPUD9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD10" edc:desc="" edc:mask="0x1" edc:name="CNPUD10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD11" edc:desc="" edc:mask="0x1" edc:name="CNPUD11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD12" edc:desc="" edc:mask="0x1" edc:name="CNPUD12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD13" edc:desc="" edc:mask="0x1" edc:name="CNPUD13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD14" edc:desc="" edc:mask="0x1" edc:name="CNPUD14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD15" edc:desc="" edc:mask="0x1" edc:name="CNPUD15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886360" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-02495_TRAN_Ports.Module" edc:_refcount="4" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNPDD" edc:desc="" edc:grp="PORTD" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="CNPDD" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDD0" edc:desc="" edc:mask="0x1" edc:name="CNPDD0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD1" edc:desc="" edc:mask="0x1" edc:name="CNPDD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD2" edc:desc="" edc:mask="0x1" edc:name="CNPDD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD3" edc:desc="" edc:mask="0x1" edc:name="CNPDD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD4" edc:desc="" edc:mask="0x1" edc:name="CNPDD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD5" edc:desc="" edc:mask="0x1" edc:name="CNPDD5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD6" edc:desc="" edc:mask="0x1" edc:name="CNPDD6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD7" edc:desc="" edc:mask="0x1" edc:name="CNPDD7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD8" edc:desc="" edc:mask="0x1" edc:name="CNPDD8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD9" edc:desc="" edc:mask="0x1" edc:name="CNPDD9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD10" edc:desc="" edc:mask="0x1" edc:name="CNPDD10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD11" edc:desc="" edc:mask="0x1" edc:name="CNPDD11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD12" edc:desc="" edc:mask="0x1" edc:name="CNPDD12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD13" edc:desc="" edc:mask="0x1" edc:name="CNPDD13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD14" edc:desc="" edc:mask="0x1" edc:name="CNPDD14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD15" edc:desc="" edc:mask="0x1" edc:name="CNPDD15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
