MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX530F128L.PIC
      <edc:SFRDef edc:_addr="0x1F88BB00" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="---------------------------rrrrr" edc:cname="C1FIFOCI30" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1FIFOCI30" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CFIFOCI" edc:desc="" edc:mask="0x1f" edc:name="CFIFOCI" edc:nzwidth="0x5"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F88BB10" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="-----------nnnnn-nnn----nnnnnnnn" edc:cname="C1FIFOCON31" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1FIFOCON31" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXPRI" edc:desc="" edc:mask="0x3" edc:name="TXPRI" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="RTREN" edc:desc="" edc:mask="0x1" edc:name="RTREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXREQ" edc:desc="" edc:mask="0x1" edc:name="TXREQ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXERR" edc:desc="" edc:mask="0x1" edc:name="TXERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXLARB" edc:desc="" edc:mask="0x1" edc:name="TXLARB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXABAT" edc:desc="" edc:mask="0x1" edc:name="TXABAT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:desc="" edc:mask="0x1" edc:name="TXEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="DONLY" edc:desc="" edc:mask="0x1" edc:name="DONLY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UINC" edc:desc="" edc:mask="0x1" edc:name="UINC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRESET" edc:desc="" edc:mask="0x1" edc:name="FRESET" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="FSIZE" edc:desc="" edc:mask="0x1f" edc:name="FSIZE" edc:nzwidth="0x5"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F88BB20" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="-----nnn----nnnn-----rrr----nrrr" edc:cname="C1FIFOINT31" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1FIFOINT31" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXNEMPTYIF" edc:desc="" edc:mask="0x1" edc:name="RXNEMPTYIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXHALFIF" edc:desc="" edc:mask="0x1" edc:name="RXHALFIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXFULLIF" edc:desc="" edc:mask="0x1" edc:name="RXFULLIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVFLIF" edc:desc="" edc:mask="0x1" edc:name="RXOVFLIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="TXEMPTYIF" edc:desc="" edc:mask="0x1" edc:name="TXEMPTYIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXHALFIF" edc:desc="" edc:mask="0x1" edc:name="TXHALFIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXNFULLIF" edc:desc="" edc:mask="0x1" edc:name="TXNFULLIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="RXNEMPTYIE" edc:desc="" edc:mask="0x1" edc:name="RXNEMPTYIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXHALFIE" edc:desc="" edc:mask="0x1" edc:name="RXHALFIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXFULLIE" edc:desc="" edc:mask="0x1" edc:name="RXFULLIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVFLIE" edc:desc="" edc:mask="0x1" edc:name="RXOVFLIE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="TXEMPTYIE" edc:desc="" edc:mask="0x1" edc:name="TXEMPTYIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXHALFIE" edc:desc="" edc:mask="0x1" edc:name="TXHALFIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXNFULLIE" edc:desc="" edc:mask="0x1" edc:name="TXNFULLIE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F88BB30" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrr--" edc:cname="C1FIFOUA31" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuu00" edc:name="C1FIFOUA31" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxx00" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="FIFOUA" edc:desc="" edc:islanghidden="true" edc:mask="0x3fffffff" edc:name="FIFOUA" edc:nzwidth="0x1e"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F88BB40" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="---------------------------rrrrr" edc:cname="C1FIFOCI31" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1FIFOCI31" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CFIFOCI" edc:desc="" edc:mask="0x1f" edc:name="CFIFOCI" edc:nzwidth="0x5"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
  </edc:PhysicalSpace>
  <edc:PinList edc:ppsflavor="complex-grouped">
    <edc:Pin>
      <!--Pin 1-->
      <edc:VirtualPin edc:name="RG15"/>
      <edc:VirtualPin edc:name="AN28"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 2-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 3-->
      <edc:VirtualPin edc:name="RE5"/>
      <edc:VirtualPin edc:name="PMD5"/>
      <edc:VirtualPin edc:name="RPE5" edc:ppsgroup="2" edc:ppsval="6"/>
      <edc:VirtualPin edc:name="AN22"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 4-->
      <edc:VirtualPin edc:name="RE6"/>
      <edc:VirtualPin edc:name="PMD6"/>
      <edc:VirtualPin edc:name="AN23"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 5-->
      <edc:VirtualPin edc:name="RE7"/>
      <edc:VirtualPin edc:name="PMD7"/>
      <edc:VirtualPin edc:name="AN27"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 6-->
      <edc:VirtualPin edc:name="RC1"/>
      <edc:VirtualPin edc:name="RPC1" edc:ppsgroup="1" edc:ppsval="10"/>
      <edc:VirtualPin edc:name="AN29"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 7-->
      <edc:VirtualPin edc:name="RC2"/>
      <edc:VirtualPin edc:name="RPC2" edc:ppsgroup="4" edc:ppsval="12"/>
      <edc:VirtualPin edc:name="AN30"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 8-->
      <edc:VirtualPin edc:name="RC3"/>
      <edc:VirtualPin edc:name="RPC3" edc:ppsgroup="3" edc:ppsval="12"/>
      <edc:VirtualPin edc:name="AN31"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 9-->
      <edc:VirtualPin edc:name="RC4"/>
      <edc:VirtualPin edc:name="CTED7"/>
      <edc:VirtualPin edc:name="RPC4" edc:ppsgroup="2" edc:ppsval="10"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 10-->
      <edc:VirtualPin edc:name="RG6"/>
      <edc:VirtualPin edc:name="PMA5"/>
      <edc:VirtualPin edc:name="SCK2"/>
      <edc:VirtualPin edc:name="RPG6" edc:ppsgroup="3" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="C1IND"/>
      <edc:VirtualPin edc:name="AN16"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 11-->
      <edc:VirtualPin edc:name="RG7"/>
      <edc:VirtualPin edc:name="PMA4"/>
      <edc:VirtualPin edc:name="RPG7" edc:ppsgroup="2" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="C1INC"/>
      <edc:VirtualPin edc:name="AN17"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 12-->
      <edc:VirtualPin edc:name="RG8"/>
      <edc:VirtualPin edc:name="PMA3"/>
      <edc:VirtualPin edc:name="RPG8" edc:ppsgroup="1" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="C2IND"/>
      <edc:VirtualPin edc:name="AN18"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 13-->
      <edc:VirtualPin edc:name="MCLR"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 14-->
      <edc:VirtualPin edc:name="RG9"/>
      <edc:VirtualPin edc:name="PMA2"/>
      <edc:VirtualPin edc:name="RPG9" edc:ppsgroup="4" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="C2INC"/>
      <edc:VirtualPin edc:name="AN19"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 15-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 16-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 17-->
      <edc:VirtualPin edc:name="RA0"/>
      <edc:VirtualPin edc:name="CTED1"/>
      <edc:VirtualPin edc:name="TMS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 18-->
      <edc:VirtualPin edc:name="RE8"/>
      <edc:VirtualPin edc:name="RPE8" edc:ppsgroup="4" edc:ppsval="13"/>
      <edc:VirtualPin edc:name="AN32"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 19-->
      <edc:VirtualPin edc:name="RE9"/>
      <edc:VirtualPin edc:name="RPE9" edc:ppsgroup="3" edc:ppsval="13"/>
      <edc:VirtualPin edc:name="AN33"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 20-->
      <edc:VirtualPin edc:name="RB5"/>
      <edc:VirtualPin edc:name="RPB5" edc:ppsgroup="1" edc:ppsval="8"/>
      <edc:VirtualPin edc:name="C1INA"/>
      <edc:VirtualPin edc:name="AN5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 21-->
      <edc:VirtualPin edc:name="RB4"/>
      <edc:VirtualPin edc:name="C1INB"/>
      <edc:VirtualPin edc:name="AN4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 22-->
      <edc:VirtualPin edc:name="RB3"/>
      <edc:VirtualPin edc:name="RPB3" edc:ppsgroup="2" edc:ppsval="8"/>
      <edc:VirtualPin edc:name="C2INA"/>
      <edc:VirtualPin edc:name="AN3"/>
      <edc:VirtualPin edc:name="PGED3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 23-->
      <edc:VirtualPin edc:name="RB2"/>
      <edc:VirtualPin edc:name="CTED13"/>
      <edc:VirtualPin edc:name="RPB2" edc:ppsgroup="3" edc:ppsval="15"/>
      <edc:VirtualPin edc:name="C2INB"/>
      <edc:VirtualPin edc:name="CTCMP"/>
      <edc:VirtualPin edc:name="AN2"/>
      <edc:VirtualPin edc:name="PGEC3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 24-->
      <edc:VirtualPin edc:name="RB1"/>
      <edc:VirtualPin edc:name="CTED12"/>
      <edc:VirtualPin edc:name="RPB1" edc:ppsgroup="2" edc:ppsval="5"/>
      <edc:VirtualPin edc:name="AN1"/>
      <edc:VirtualPin edc:name="PGEC1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 25-->
      <edc:VirtualPin edc:name="RB0"/>
      <edc:VirtualPin edc:name="RPB0" edc:ppsgroup="3" edc:ppsval="5"/>
      <edc:VirtualPin edc:name="AN0"/>
      <edc:VirtualPin edc:name="PGED1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 26-->
      <edc:VirtualPin edc:name="RB6"/>
      <edc:VirtualPin edc:name="RPB6" edc:ppsgroup="4" edc:ppsval="5"/>
      <edc:VirtualPin edc:name="AN6"/>
      <edc:VirtualPin edc:name="PGEC2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 27-->
      <edc:VirtualPin edc:name="RB7"/>
      <edc:VirtualPin edc:name="CTED3"/>
      <edc:VirtualPin edc:name="RPB7" edc:ppsgroup="3" edc:ppsval="7"/>
      <edc:VirtualPin edc:name="AN7"/>
      <edc:VirtualPin edc:name="PGED2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 28-->
      <edc:VirtualPin edc:name="RA9"/>
      <edc:VirtualPin edc:name="PMA7"/>
      <edc:VirtualPin edc:name="VREF-"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 29-->
      <edc:VirtualPin edc:name="RA10"/>
      <edc:VirtualPin edc:name="PMA6"/>
      <edc:VirtualPin edc:name="VREF+"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 30-->
      <edc:VirtualPin edc:name="AVDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 31-->
      <edc:VirtualPin edc:name="AVSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 32-->
      <edc:VirtualPin edc:name="RB8"/>
      <edc:VirtualPin edc:name="CTED10"/>
      <edc:VirtualPin edc:name="RPB8" edc:ppsgroup="3" edc:ppsval="2"/>
      <edc:VirtualPin edc:name="AN8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 33-->
      <edc:VirtualPin edc:name="RB9"/>
      <edc:VirtualPin edc:name="CTED4"/>
      <edc:VirtualPin edc:name="RPB9" edc:ppsgroup="1" edc:ppsval="5"/>
      <edc:VirtualPin edc:name="AN9"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 34-->
      <edc:VirtualPin edc:name="RB10"/>
      <edc:VirtualPin edc:name="PMA13"/>
      <edc:VirtualPin edc:name="CTED11"/>
      <edc:VirtualPin edc:name="RPB10" edc:ppsgroup="1" edc:ppsval="6"/>
      <edc:VirtualPin edc:name="AN10"/>
      <edc:VirtualPin edc:name="CVREFOUT"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 35-->
      <edc:VirtualPin edc:name="RB11"/>
      <edc:VirtualPin edc:name="PMA12"/>
      <edc:VirtualPin edc:name="AN11"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 36-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 37-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 38-->
      <edc:VirtualPin edc:name="RA1"/>
      <edc:VirtualPin edc:name="CTED2"/>
      <edc:VirtualPin edc:name="TCK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 39-->
      <edc:VirtualPin edc:name="RF13"/>
      <edc:VirtualPin edc:name="SCK3"/>
      <edc:VirtualPin edc:name="RPF13" edc:ppsgroup="4" edc:ppsval="9"/>
      <edc:VirtualPin edc:name="AN34"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 40-->
      <edc:VirtualPin edc:name="RF12"/>
      <edc:VirtualPin edc:name="RPF12" edc:ppsgroup="3" edc:ppsval="9"/>
      <edc:VirtualPin edc:name="AN35"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 41-->
      <edc:VirtualPin edc:name="RB12"/>
      <edc:VirtualPin edc:name="PMA11"/>
      <edc:VirtualPin edc:name="AN12"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 42-->
      <edc:VirtualPin edc:name="RB13"/>
      <edc:VirtualPin edc:name="PMA10"/>
      <edc:VirtualPin edc:name="AN13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 43-->
      <edc:VirtualPin edc:name="RB14"/>
      <edc:VirtualPin edc:name="PMA1"/>
      <edc:VirtualPin edc:name="CTED5"/>
      <edc:VirtualPin edc:name="RPB14" edc:ppsgroup="4" edc:ppsval="2"/>
      <edc:VirtualPin edc:name="AN14"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 44-->
      <edc:VirtualPin edc:name="RB15"/>
      <edc:VirtualPin edc:name="PMA0"/>
      <edc:VirtualPin edc:name="CTED6"/>
      <edc:VirtualPin edc:name="OCFB"/>
      <edc:VirtualPin edc:name="RPB15" edc:ppsgroup="3" edc:ppsval="3"/>
      <edc:VirtualPin edc:name="AN15"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 45-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 46-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 47-->
      <edc:VirtualPin edc:name="RD14"/>
      <edc:VirtualPin edc:name="RPD14" edc:ppsgroup="1" edc:ppsval="11"/>
      <edc:VirtualPin edc:name="AN36"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 48-->
      <edc:VirtualPin edc:name="RD15"/>
      <edc:VirtualPin edc:name="SCK4"/>
      <edc:VirtualPin edc:name="RPD15" edc:ppsgroup="2" edc:ppsval="11"/>
      <edc:VirtualPin edc:name="AN37"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 49-->
      <edc:VirtualPin edc:name="RF4"/>
      <edc:VirtualPin edc:name="PMA9"/>
      <edc:VirtualPin edc:name="RPF4" edc:ppsgroup="1" edc:ppsval="2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 50-->
      <edc:VirtualPin edc:name="RF5"/>
      <edc:VirtualPin edc:name="PMA8"/>
      <edc:VirtualPin edc:name="RPF5" edc:ppsgroup="2" edc:ppsval="2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 51-->
      <edc:VirtualPin edc:name="RF3"/>
      <edc:VirtualPin edc:name="RPF3" edc:ppsgroup="4" edc:ppsval="8"/>
      <edc:VirtualPin edc:name="USBID"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 52-->
      <edc:VirtualPin edc:name="RF2"/>
      <edc:VirtualPin edc:name="RPF2" edc:ppsgroup="1" edc:ppsval="15"/>
      <edc:VirtualPin edc:name="AN38"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 53-->
      <edc:VirtualPin edc:name="RF8"/>
      <edc:VirtualPin edc:name="RPF8" edc:ppsgroup="3" edc:ppsval="11"/>
      <edc:VirtualPin edc:name="AN39"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 54-->
      <edc:VirtualPin edc:name="VBUS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 55-->
      <edc:VirtualPin edc:name="VUSB3V3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 56-->
      <edc:VirtualPin edc:name="D-"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 57-->
      <edc:VirtualPin edc:name="D+"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 58-->
      <edc:VirtualPin edc:name="RA2"/>
      <edc:VirtualPin edc:name="SCL2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 59-->
      <edc:VirtualPin edc:name="RA3"/>
      <edc:VirtualPin edc:name="SDA2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 60-->
      <edc:VirtualPin edc:name="RA4"/>
      <edc:VirtualPin edc:name="CTED9"/>
      <edc:VirtualPin edc:name="TDI"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 61-->
      <edc:VirtualPin edc:name="RA5"/>
      <edc:VirtualPin edc:name="TDO"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 62-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 63-->
      <edc:VirtualPin edc:name="RC12"/>
      <edc:VirtualPin edc:name="CLKI"/>
      <edc:VirtualPin edc:name="OSC1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 64-->
      <edc:VirtualPin edc:name="RC15"/>
      <edc:VirtualPin edc:name="CLKO"/>
      <edc:VirtualPin edc:name="OSC2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 65-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 66-->
      <edc:VirtualPin edc:name="RA14"/>
      <edc:VirtualPin edc:name="SCL1"/>
      <edc:VirtualPin edc:name="RPA14" edc:ppsgroup="1" edc:ppsval="13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 67-->
      <edc:VirtualPin edc:name="RA15"/>
      <edc:VirtualPin edc:name="SDA1"/>
      <edc:VirtualPin edc:name="RPA15" edc:ppsgroup="2" edc:ppsval="13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 68-->
      <edc:VirtualPin edc:name="RD8"/>
      <edc:VirtualPin edc:name="RTCC"/>
      <edc:VirtualPin edc:name="RPD8" edc:ppsgroup="4" edc:ppsval="4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 69-->
      <edc:VirtualPin edc:name="RD9"/>
      <edc:VirtualPin edc:name="RPD9" edc:ppsgroup="3" edc:ppsval="0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 70-->
      <edc:VirtualPin edc:name="RD10"/>
      <edc:VirtualPin edc:name="PMA15"/>
      <edc:VirtualPin edc:name="SCK1"/>
      <edc:VirtualPin edc:name="RPD10" edc:ppsgroup="1" edc:ppsval="3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 71-->
      <edc:VirtualPin edc:name="RD11"/>
      <edc:VirtualPin edc:name="PMA14"/>
      <edc:VirtualPin edc:name="RPD11" edc:ppsgroup="2" edc:ppsval="3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 72-->
      <edc:VirtualPin edc:name="RD0"/>
      <edc:VirtualPin edc:name="INT0"/>
      <edc:VirtualPin edc:name="RPD0" edc:ppsgroup="4" edc:ppsval="3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 73-->
      <edc:VirtualPin edc:name="RC13"/>
      <edc:VirtualPin edc:name="RPC13" edc:ppsgroup="2" edc:ppsval="7"/>
      <edc:VirtualPin edc:name="SOSCI"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 74-->
      <edc:VirtualPin edc:name="RC14"/>
      <edc:VirtualPin edc:name="T1CK"/>
      <edc:VirtualPin edc:name="RPC14" edc:ppsgroup="1" edc:ppsval="7"/>
      <edc:VirtualPin edc:name="SOSCO"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 75-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 76-->
      <edc:VirtualPin edc:name="RD1"/>
      <edc:VirtualPin edc:name="RPD1" edc:ppsgroup="4" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="AN24"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 77-->
      <edc:VirtualPin edc:name="RD2"/>
      <edc:VirtualPin edc:name="RPD2" edc:ppsgroup="1" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="AN25"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 78-->
      <edc:VirtualPin edc:name="RD3"/>
      <edc:VirtualPin edc:name="RPD3" edc:ppsgroup="2" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="C3IND"/>
      <edc:VirtualPin edc:name="AN26"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 79-->
      <edc:VirtualPin edc:name="RD12"/>
      <edc:VirtualPin edc:name="PMD12"/>
      <edc:VirtualPin edc:name="RPD12" edc:ppsgroup="3" edc:ppsval="10"/>
      <edc:VirtualPin edc:name="AN40"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 80-->
      <edc:VirtualPin edc:name="RD13"/>
      <edc:VirtualPin edc:name="PMD13"/>
      <edc:VirtualPin edc:name="AN41"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 81-->
      <edc:VirtualPin edc:name="RD4"/>
      <edc:VirtualPin edc:name="PMWR"/>
      <edc:VirtualPin edc:name="RPD4" edc:ppsgroup="3" edc:ppsval="4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 82-->
      <edc:VirtualPin edc:name="RD5"/>
      <edc:VirtualPin edc:name="PMRD"/>
      <edc:VirtualPin edc:name="RPD5" edc:ppsgroup="4" edc:ppsval="6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 83-->
      <edc:VirtualPin edc:name="RD6"/>
      <edc:VirtualPin edc:name="PMD14"/>
      <edc:VirtualPin edc:name="C3INC"/>
      <edc:VirtualPin edc:name="AN42"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 84-->
      <edc:VirtualPin edc:name="RD7"/>
      <edc:VirtualPin edc:name="PMD15"/>
      <edc:VirtualPin edc:name="C3INB"/>
      <edc:VirtualPin edc:name="AN43"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 85-->
      <edc:VirtualPin edc:name="VCAP"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 86-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 87-->
      <edc:VirtualPin edc:name="RF0"/>
      <edc:VirtualPin edc:name="PMD11"/>
      <edc:VirtualPin edc:name="RPF0" edc:ppsgroup="2" edc:ppsval="4"/>
      <edc:VirtualPin edc:name="C3INA"/>
      <edc:VirtualPin edc:name="AN44"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 88-->
      <edc:VirtualPin edc:name="RF1"/>
      <edc:VirtualPin edc:name="PMD10"/>
      <edc:VirtualPin edc:name="RPF1" edc:ppsgroup="1" edc:ppsval="4"/>
      <edc:VirtualPin edc:name="AN45"/>
    </edc:Pin>
